# --- Taps ---
tap "homebrew/bundle"

# --- Terminal ---
cask "ghostty"

# --- Shell & Prompt ---
brew "zsh"
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# --- Editor ---
brew "neovim"

# --- Terminal Multiplexer ---
brew "tmux"

# --- Version Management ---
brew "mise"

# --- Git ---
brew "git"
brew "git-delta"
brew "lazygit"
brew "gh"

# --- Search & Navigation ---
brew "ripgrep"
brew "fd"
brew "fzf"
brew "bat"
brew "eza"
brew "zoxide"

# --- Data & JSON ---
brew "jq"
brew "yq"
brew "xsv"

# --- Networking ---
brew "httpie"
brew "curl"
brew "wget"

# --- Containers & Kubernetes ---
brew "kubectl"
brew "kubectx"
brew "k9s"
brew "helm"
brew "stern"

# --- Infrastructure ---
brew "terraform"

# --- Utilities ---
brew "stow"
brew "tree"
brew "tldr"
brew "watch"
brew "direnv"
brew "gnupg"

# --- Fonts ---
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-symbols-only-nerd-font"
